Revit 2027 API
ParameterTypeId.AnalyticalModelStickElementsMark Property
 "Member Number": Used for beams, braces, columns
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelStickElementsMark { get; }
Public Shared ReadOnly Property AnalyticalModelStickElementsMark As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelStickElementsMark {
	ForgeTypeId^ get ();
}
static member AnalyticalModelStickElementsMark : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace